### Pandas is a popular Python library that provides high-performance, easy-to-use data structures, and data analysis tools. One of the key data structures provided by pandas is the DataFrame.Panda libraray helps in :
1. Loading our data from another file(csv, excel, sql, json, xml, html)
2. Data Cleaning 
3. Data Selection 
4. Data Filtering 
5. Data Aggregation
6. Data transformation 
7. Data visualization 
8. Descriptive Analysis

#### Dask and spark data frame are a better alternative of panda.

# Panda Data Structure

In [3]:
#Imporing pandas and creating a dataframe
import pandas as pd
data_frame=pd.DataFrame()
print(data_frame)

Empty DataFrame
Columns: []
Index: []

In [4]:
#Example 1
my_data=[["Sheetal",23],["Simmi",21],["Sanjay",23],["Sunny",22],["Rishi",22],["Anuj",24],["Shivani",21]]
data_frame=pd.DataFrame(my_data,columns=["Name","Age"])
print(data_frame)

      Name  Age
0  Sheetal   23
1    Simmi   21
2   Sanjay   23
3    Sunny   22
4    Rishi   22
5     Anuj   24
6  Shivani   21

In [5]:
#Example 2
data2={"Name":["Ardhana","Mehul","Rishabh","Vijay"],"Age":[23,22,21,24]}
data_frame2=pd.DataFrame(data2)
print(data_frame2)

      Name  Age
0  Ardhana   23
1    Mehul   22
2  Rishabh   21
3    Vijay   24

In [6]:
#Example 3
data4=[{"col1":26,"col2":34},{"col1":26,"col2":34,"col3":35}]
data_frame4=pd.DataFrame(data4)
print(data_frame4)

   col1  col2  col3
0    26    34   NaN
1    26    34  35.0

__note__: NaN is a Null Value

In [7]:
#Checking data type of a column
data_frame4["col1"].dtype

dtype('int64')

In [8]:
#Renaming index
data5={"Name":["Alice", "Bob", "Charlie", "David", "Emma", "Frank"],"Age":[23,19,32,24,26,25]}
df=pd.DataFrame(data5, index=["(i)","(ii)","(iii)","(iv)","(v)","(vi)"])
print(df)

          Name  Age
(i)      Alice   23
(ii)       Bob   19
(iii)  Charlie   32
(iv)     David   24
(v)       Emma   26
(vi)     Frank   25

In [9]:
#reading acsv file
pd.read_csv("./student.csv")

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [10]:
#Example
import json as js
data='''{
    "NGO Name":"Saboori foundation",
    "Phone Number":7895654805,
    "Head":"Sheetal Jain",
    "Estd.":2003,
    "Branch":["Agra","Bhopal","Maharastra","Junagarh"]
}'''
entry=js.loads(data)

In [11]:
#Creating a data frame from a json object
json_data=pd.DataFrame(entry)
json_data

             NGO Name  Phone Number          Head  Estd.      Branch
0  Saboori foundation    7895654805  Sheetal Jain   2003        Agra
1  Saboori foundation    7895654805  Sheetal Jain   2003      Bhopal
2  Saboori foundation    7895654805  Sheetal Jain   2003  Maharastra
3  Saboori foundation    7895654805  Sheetal Jain   2003    Junagarh

In [12]:
#Example :  data frame using an HTML link 
data=pd.read_html("https://www.pro-football-reference.com/teams/")
data

[          Unnamed: 0_level_0 Unnamed: 1_level_0 Unnamed: 2_level_0  \
                           Tm               From                 To
 0          Arizona Cardinals               1920               2023
 1          Chicago Cardinals               1920               1943
 2     Chi/Pit Cards/Steelers               1944               1944
 3          Chicago Cardinals               1945               1959
 4        St. Louis Cardinals               1960               1987
 ..                       ...                ...                ...
 73             Boston Braves               1932               1932
 74           Boston Redskins               1933               1936
 75       Washington Redskins               1937               2019
 76  Washington Football Team               2020               2021
 77     Washington Commanders               2022               2023

    Unnamed: 3_level_0 Unnamed: 4_level_0 Unnamed: 5_level_0  \
                     W                  L                  T
 0                 585                803                 41
 1                  99                141                 21
 2                   0                 10                  0
 3                  66                107                  4
 4                 186                202                 14
 ..                ...                ...                ...
 73                  4                  4                  2
 74                 20                 24                  3
 75                579                575                 23
 76                 14                 19                  0
 77                 12                 21                  1

    Unnamed: 6_level_0 Unnamed: 7_level_0 Top Performers                        \
                  W-L%                 AV         Passer    Rusher    Receiver
 0               0.422         Fitzgerald           Hart  Anderson  Fitzgerald
 1               0.413                NaN            NaN       NaN         NaN
 2               0.000                NaN            NaN       NaN         NaN
 3               0.382                NaN            NaN       NaN         NaN
 4               0.480                NaN            NaN       NaN         NaN
 ..                ...                ...            ...       ...         ...
 73              0.500                NaN            NaN       NaN         NaN
 74              0.455                NaN            NaN       NaN         NaN
 75              0.502                NaN            NaN       NaN         NaN
 76              0.424                NaN            NaN       NaN         NaN
 77              0.368                NaN            NaN       NaN         NaN

             Unnamed: 12_level_0 Playoffs               Unnamed: 16_level_0  \
    Coaching             Yr plyf   W plyf L plyf   W-L%                Chmp
 0    Arians                11.0      7.0   10.0  0.412                 2.0
 1       NaN                 0.0      0.0    0.0    NaN                 1.0
 2       NaN                 0.0      0.0    0.0    NaN                 0.0
 3       NaN                 2.0      1.0    1.0    NaN                 1.0
 4       NaN                 3.0      0.0    3.0    NaN                 0.0
 ..      ...                 ...      ...    ...    ...                 ...
 73      NaN                 0.0      0.0    0.0    NaN                 0.0
 74      NaN                 1.0      0.0    1.0    NaN                 0.0
 75      NaN                23.0     23.0   18.0    NaN                 5.0
 76      NaN                 1.0      0.0    1.0    NaN                 NaN
 77      NaN                 NaN      NaN    NaN    NaN                 NaN

    Unnamed: 17_level_0 Unnamed: 18_level_0 Unnamed: 19_level_0
                   SBwl                Conf                 Div
 0                  0.0                 1.0                   8
 1                  0.0                 0.0                   1
 2                  0.0                 0.0                   0
 3                  0.0                 0.0                   2
 4                  0.0                 0.0                   2
 ..                 ...                 ...                 ...
 73                 0.0                 0.0                   0
 74                 0.0                 0.0                   1
 75                 3.0                 5.0                  14
 76                 0.0                 NaN                   1
 77                 NaN                 NaN                   0

 [78 rows x 20 columns]]

In [13]:
#Some important attribute of dara frame
#dtype
print(json_data.dtypes)
#shape
print(json_data.shape)
#head(),tail(),sample(n)
print("_______________________________________________________\n",json_data.head(2))
print("_______________________________________________________\n",json_data.tail(2))
print("_______________________________________________________\n",json_data.sample(3))

NGO Name        object
Phone Number     int64
Head            object
Estd.            int64
Branch          object
dtype: object
(4, 5)
_______________________________________________________
              NGO Name  Phone Number          Head  Estd.  Branch
0  Saboori foundation    7895654805  Sheetal Jain   2003    Agra
1  Saboori foundation    7895654805  Sheetal Jain   2003  Bhopal
_______________________________________________________
              NGO Name  Phone Number          Head  Estd.      Branch
2  Saboori foundation    7895654805  Sheetal Jain   2003  Maharastra
3  Saboori foundation    7895654805  Sheetal Jain   2003    Junagarh
_______________________________________________________
              NGO Name  Phone Number          Head  Estd.      Branch
2  Saboori foundation    7895654805  Sheetal Jain   2003  Maharastra
1  Saboori foundation    7895654805  Sheetal Jain   2003      Bhopal
3  Saboori foundation    7895654805  Sheetal Jain   2003    Junagarh

# Converting into a numpy array

In [14]:
#Values attribute
data_array=json_data.values
data_array

array([['Saboori foundation', 7895654805, 'Sheetal Jain', 2003, 'Agra'],
       ['Saboori foundation', 7895654805, 'Sheetal Jain', 2003, 'Bhopal'],
       ['Saboori foundation', 7895654805, 'Sheetal Jain', 2003,
        'Maharastra'],
       ['Saboori foundation', 7895654805, 'Sheetal Jain', 2003,
        'Junagarh']], dtype=object)

In [15]:
#size
data_array.size

20

In [16]:
#ndim
data_array.ndim

2

In [17]:
#Transpose
json_data.T

,0,1,2,3
NGO Name,Saboori foundation,Saboori foundation,Saboori foundation,Saboori foundation
Phone Number,7895654805,7895654805,7895654805,7895654805
Head,Sheetal Jain,Sheetal Jain,Sheetal Jain,Sheetal Jain
Estd.,2003,2003,2003,2003
Branch,Agra,Bhopal,Maharastra,Junagarh

In [18]:
#empty
json_data.empty

False

In [19]:
#Example
pd.DataFrame().empty

True

# apply()

In [20]:
#Example 1
import pandas as pd
import numpy as np
data6=pd.DataFrame(np.random.randint(23,45,25).reshape(5,5),columns=["Col1","Col2","Col3","Col4","Col5"])
print(data6)
print(data6.apply(np.mean))
print(data6.apply(np.median))
print(data6.apply(np.sum))

   Col1  Col2  Col3  Col4  Col5
0    36    37    42    29    33
1    38    28    41    28    26
2    30    34    36    44    27
3    24    35    28    41    24
4    34    35    36    35    36
Col1    32.4
Col2    33.8
Col3    36.6
Col4    35.4
Col5    29.2
dtype: float64
Col1    34.0
Col2    35.0
Col3    36.0
Col4    35.0
Col5    27.0
dtype: float64
Col1    162
Col2    169
Col3    183
Col4    177
Col5    146
dtype: int64

In [21]:
#Example 2: Applying a lamda function on a dataframe
print(data6.apply(lambda x:(max(x)-min(x))))

Col1    14
Col2     9
Col3    14
Col4    16
Col5    12
dtype: int64

In [22]:
#Example3: Applying on  particular column
print(data6["Col4"].apply(lambda x:x**2))

0     841
1     784
2    1936
3    1681
4    1225
Name: Col4, dtype: int64

In [23]:
#Applying map function
data7=data6["Col4"].map(lambda x:x+100)
print(data7)

0    129
1    128
2    144
3    141
4    135
Name: Col4, dtype: int64

In [24]:
#Renaming 
json_data.rename(columns={"Head":"Caretaker"},index={0:"Entry 1"})

                   NGO Name  Phone Number     Caretaker  Estd.      Branch
Entry 1  Saboori foundation    7895654805  Sheetal Jain   2003        Agra
1        Saboori foundation    7895654805  Sheetal Jain   2003      Bhopal
2        Saboori foundation    7895654805  Sheetal Jain   2003  Maharastra
3        Saboori foundation    7895654805  Sheetal Jain   2003    Junagarh

In [35]:
#Fetching dataframeitems
for row in json_data.items():
    print(row)

('NGO Name', 0    Saboori foundation
1    Saboori foundation
2    Saboori foundation
3    Saboori foundation
Name: NGO Name, dtype: object)
('Phone Number', 0    7895654805
1    7895654805
2    7895654805
3    7895654805
Name: Phone Number, dtype: int64)
('Head', 0    Sheetal Jain
1    Sheetal Jain
2    Sheetal Jain
3    Sheetal Jain
Name: Head, dtype: object)
('Estd.', 0    2003
1    2003
2    2003
3    2003
Name: Estd., dtype: int64)
('Branch', 0          Agra
1        Bhopal
2    Maharastra
3      Junagarh
Name: Branch, dtype: object)

In [36]:
#Example 2 for iterrows()
for col,row in json_data.iterrows():
    print(col,row)

0 NGO Name        Saboori foundation
Phone Number            7895654805
Head                  Sheetal Jain
Estd.                         2003
Branch                        Agra
Name: 0, dtype: object
1 NGO Name        Saboori foundation
Phone Number            7895654805
Head                  Sheetal Jain
Estd.                         2003
Branch                      Bhopal
Name: 1, dtype: object
2 NGO Name        Saboori foundation
Phone Number            7895654805
Head                  Sheetal Jain
Estd.                         2003
Branch                  Maharastra
Name: 2, dtype: object
3 NGO Name        Saboori foundation
Phone Number            7895654805
Head                  Sheetal Jain
Estd.                         2003
Branch                    Junagarh
Name: 3, dtype: object

In [37]:
#Example 3 for itertuple()
for i in json_data.itertuples():
    print(i)

Pandas(Index=0, _1='Saboori foundation', _2=7895654805, Head='Sheetal Jain', _4=2003, Branch='Agra')
Pandas(Index=1, _1='Saboori foundation', _2=7895654805, Head='Sheetal Jain', _4=2003, Branch='Bhopal')
Pandas(Index=2, _1='Saboori foundation', _2=7895654805, Head='Sheetal Jain', _4=2003, Branch='Maharastra')
Pandas(Index=3, _1='Saboori foundation', _2=7895654805, Head='Sheetal Jain', _4=2003, Branch='Junagarh')

# soritng

In [38]:
#Example :  sorting on the basis of column 5
json_data.sort_values(by="Branch")

             NGO Name  Phone Number          Head  Estd.      Branch
0  Saboori foundation    7895654805  Sheetal Jain   2003        Agra
1  Saboori foundation    7895654805  Sheetal Jain   2003      Bhopal
3  Saboori foundation    7895654805  Sheetal Jain   2003    Junagarh
2  Saboori foundation    7895654805  Sheetal Jain   2003  Maharastra

# Reindexing

In [39]:
import pandas as pd
data={ "ids" : [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
         "Name": ["Ardhana","Mehul","Rishabh","Vijay","Alice", "Bob", "Charlie", "David", "Emma", "Frank"],
         "designations" : ["Manager", "Engineer", "Analyst", "Director", "Coordinator", "Developer", "Supervisor", "Specialist", "Consultant", "Administrator"],
         "salaries" : [50000, 60000, 75000, 90000, 55000, 80000, 65000, 70000, 85000, 95000]
        }
dataset=pd.DataFrame(data,index=[1,2,3,4,5,6,7,8,9,10])
print(dataset)
dataset.set_index('ids',inplace=True)

     ids     Name   designations  salaries
1   1001  Ardhana        Manager     50000
2   1002    Mehul       Engineer     60000
3   1003  Rishabh        Analyst     75000
4   1004    Vijay       Director     90000
5   1005    Alice    Coordinator     55000
6   1006      Bob      Developer     80000
7   1007  Charlie     Supervisor     65000
8   1008    David     Specialist     70000
9   1009     Emma     Consultant     85000
10  1010    Frank  Administrator     95000

In [40]:
dataset

         Name   designations  salaries
ids
1001  Ardhana        Manager     50000
1002    Mehul       Engineer     60000
1003  Rishabh        Analyst     75000
1004    Vijay       Director     90000
1005    Alice    Coordinator     55000
1006      Bob      Developer     80000
1007  Charlie     Supervisor     65000
1008    David     Specialist     70000
1009     Emma     Consultant     85000
1010    Frank  Administrator     95000

In [41]:
# Assuming 'dataset' is your DataFrame

# Convert 'salaries' column to numeric type
dataset['salaries'] = pd.to_numeric(dataset['salaries'], errors='coerce')

# Slicing based on 'salaries' values
column = dataset[dataset['salaries'] > 55000]
print(column)

         Name   designations  salaries
ids
1002    Mehul       Engineer     60000
1003  Rishabh        Analyst     75000
1004    Vijay       Director     90000
1006      Bob      Developer     80000
1007  Charlie     Supervisor     65000
1008    David     Specialist     70000
1009     Emma     Consultant     85000
1010    Frank  Administrator     95000

In [42]:
dataset1=dataset[dataset.index>1005]['salaries']
print(dataset1[2:5])

ids
1008    70000
1009    85000
1010    95000
Name: salaries, dtype: int64

In [43]:
dataset['Name'].replace({'Mehul':'Mehar'}, inplace=True)

In [44]:
dataset

         Name   designations  salaries
ids
1001  Ardhana        Manager     50000
1002    Mehar       Engineer     60000
1003  Rishabh        Analyst     75000
1004    Vijay       Director     90000
1005    Alice    Coordinator     55000
1006      Bob      Developer     80000
1007  Charlie     Supervisor     65000
1008    David     Specialist     70000
1009     Emma     Consultant     85000
1010    Frank  Administrator     95000

# Practicing Panda For Data Analysis

## Reading a CSV file using Pandas
Let's download a file `italy-covid-daywise.txt` which contains day-wise Covid-19 data for Italy in the following format:

```
date,new_cases,new_deaths,new_tests
2020-04-21,2256.0,454.0,28095.0
2020-04-22,2729.0,534.0,44248.0
2020-04-23,3370.0,437.0,37083.0
2020-04-24,2646.0,464.0,95273.0
2020-04-25,3021.0,420.0,38676.0
2020-04-26,2357.0,415.0,24113.0
2020-04-27,2324.0,260.0,26678.0
2020-04-28,1739.0,333.0,37554.0
...
```

This format of storing data is known as *comma-separated values* or CSV. 

> **CSVs**: A comma-separated values (CSV) file is a delimited text file that uses a comma to separate values. Each line of the file is a data record. Each record consists of one or more fields, separated by commas. A CSV file typically stores tabular data (numbers and text) in plain text, in which case each line will have the same number of fields. (Wikipedia)


We'll download this file using the `urlretrieve` function from the `urllib.request` module.

In [52]:
from urllib.request import urlretrieve
italy_covid_url = 'https://gist.githubusercontent.com/aakashns/f6a004fa20c84fec53262f9a8bfee775/raw/f309558b1cf5103424cef58e2ecb8704dcd4d74c/italy-covid-daywise.csv'
urlretrieve(italy_covid_url, 'italy-covid-daywise.csv')

('italy-covid-daywise.csv', <http.client.HTTPMessage at 0x17cfb3e6110>)

## Importing and starting working with pandas

In [53]:
import pandas as pd
covid_data_frame = pd.read_csv('italy-covid-daywise.csv')
covid_data_frame

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

# info() fucntion for knowing what the data frame contains

In [51]:
covid_data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
dtypes: float64(3), object(1)
memory usage: 7.9+ KB